python语言介绍
=== 
## （了解）准备
### 图例
		普通重要程度
（了解） 内容不重要或是有难度
(重点)  重中之重

### 学习方法
老师边敲案例，同学边跟着做。遇到问题提问或发截图到群里。


## python语言特点
- 面向对象：以对象为中心思考问题，软件项目利于扩展和维护。
- 丰富的库：库好像是汽车或家电的零件。我们不需要从头开发一个功能，只需要引用别人开发好的功能，组装成我们的项目。python库非常丰富，pypi网站上有十几万项目，包括数据分析、做网站、机器学习等领域。
- 语言扩展：python可以调用其它语言如C、C++、java编写的模块。更加便利。俗称“胶水语言”。
- 简洁：要求强制缩进。优点代码风格统一，易于维护。可以让程序员把更多的精力放在业务实现上。编程语言只是工具，更重要的是用工具来造东西。
- 动态语言，解释型语言： 计算机只认二进制01。C、C++、java这些语言需要编译成二进制，静态语言。
而python代码先转换成一种形式，中间产物再由py解释器来解释，缺点是效率降低，优点代码开发效率，跨平台。

## 应用场景
- 爬虫      爬取网页信息
- web网页   做网站，信息管理系统
- 后端接口
- 数据分析	大数据分析
- 科学计算   matlab 数学公式  火箭发射、水坝水流等复杂计算
- 机器学习	语言识别、图像识别
- 驱动硬件   树莓派，智能家居
- 跟其它语言项目做配合


## （了解）其它语言
- 后端： java python php
- 前端： js nodejs
- 底层、硬件： C C++
- 桌面客户端、游戏：C++ .net
- 其它：lisp 易语言
